import { useState } from "react";

import "./ServiceModal.css";

function ServiceModal() {

  const [isOpen, setIsOpen] = useState(true);

  if (!isOpen) return null;

  return (

    <div className="modal-overlay">

      <div className="modal">


        <button

          className="close-btn"

          onClick={() => setIsOpen(false)}

        >

          ✕

        </button>

        <h2>

          اتفاقية الخدمة

        </h2>

        <div className="modal-content">

          <h3>

            1. مقدمة وتعريفات

          </h3>

          <p>

تحكم هذه الاتفاقية استخدامك لمنصة وصل، وهي خدمة رقمية تسهل الربط بين مزودي طاقة المولدات الكهربائية والمستهلكين بدخولك الى المنصة او استخدامها، فإنك توافق على الالتزام بهذه الشروط

          </p>

          <h3>

            2. حساب المستخدم

          </h3>

          <p>

           لضمان تجربة آمنة يتوجب على المستخدمين تقديم معلومات دقيقة ومحدثة عند انشاء الحساب أنت مسؤول بشكل كامل عن الحفاظ على سرية بيانات اعتماد دخولك وعن جميع الأنشطة التي تحدث تحت حسابك.
          </p>

          <h3>

            3. وصف الخدمات

          </h3>

          <p>

توفر "وصل" واجهة لإدارة استهلاك الطاقة ومراقبة العدادات الذكية ودفع الفواتير إلكترونياً. 
يرجى ملاحظة أن "وصل" هي وسيط تقني ولا تملك المولدات الكهربائية مباشرة
          </p>

          <h3>

            4. الرسوم والفواتير

          </h3>

          <p>

يتم احتساب الرسوم بناءً على سعر الأمبير المتفق عليه من قبل المزود المحلي بالإضافة إلى رسوم الخدمة التقنية لمنصة "وصل"
          </p>

          <h3>

            5. حدود المسؤولية

          </h3>

          <p>

تسعى"وصل" جاهدة لضمان استمرارية عمل المنصة بنسبة توافر 99.9٪ ، ولكنها لا تضمن عدم حدوث أخطاء تقنية ناتجة عن تحديثات النظام

          </p>

        </div>

        <button

          className="agree-btn"

          onClick={() => setIsOpen(false)}

        >

          أوافق على الشروط

        </button>

      </div>

    </div>

  );

}

export default ServiceModal;

